//------------------------------------------------------------------------------------------------------------
//	
//------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <string>
#include <print>

#include "save.h"

// [문제] int가 저장할 수 있는 최댓값을 설정하고 화면에 출력하라. 
// int가 저장할 수 있는 최댓값을 출력하라.

int main()
{	
	//int n{ 0b01111111'11111111'11111111'11111111 };
	int n{ 0x7F'FF'FF'FF };

	std::cout << "n에 저장된 값은 " << n << std::endl;

	save("main.cpp");

}