//------------------------------------------------------------------------------------------------------------
// 12. 15 - 기말 고사 : 다형성 구현
// 사용자 정의 자료형 
//------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <fstream>
#include <string>

#include "save.h"

class Dog {	//맴버 변수를 private하게 -> class
private:
	std::string name{};
};

int main()
{
	Dog dog;
	dog.name = "asd";	//외부에서 맘대로 접근하면 안된다. 
	//save("main.cpp");
}

