//------------------------------------------------------------------------------------------------------------
//	자료형과 변수 
//------------------------------------------------------------------------------------------------------------
#include <iostream>

#include "save.h"

int main()
{	

	// [실습] 다른 자료형으로 바꿔 내용을 확인하자
	long long n = 1234;

	// 언제나 메모리를 차지하고 있는 객체의 다음 질문으로 확인할 수 있다.
	std::cout << sizeof n << std::endl;	// 1. 크기는?
	std::cout << std::addressof(n) << std::endl;// 2. 주소는?
	std::cout << typeid(n).name() << std::endl;// 3. 자료형은?


	save("main.cpp");
}