//------------------------------------------------------------------------------------------------------------
//	
//------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <string>

#include "save.h"

// [문제] 이름을 물어보고 반갑다고 인사하자.
// 예) 다음가 같이 실행되게 해 본다. 

//	이름은? 씨쁠쁠
// 씨쁠쁠니 반갑습니다. 

int main()
{	
	std::string name;
	std::cout << "이름은? ";
	std::cin >> name;

	std::cout << name << "님 반갑습니다. ";

	save("main.cpp");

}