//------------------------------------------------------------------------------------------------------------
// change
// 두 개 변수의 값을 서로 바꾸는 함수를 만든다. 
// pointer, reference, 원격 조종
//------------------------------------------------------------------------------------------------------------
#include <iostream>

#include "save.h"


int main()
{
	int a{ 1 }, b{ 2 };

	// 여기서 코딩으로 a와 b의 값을 바꿔주세요
	int temp{ a };
	a = b;
	b = temp;
	//간단한 3줄이지만 하나의 알고리즘이다

	std::cout << "a - " << a << ", b - " << b << std::endl;	//a - 2, b - 1

	//save("main.cpp");
}
