//------------------------------------------------------------------------------------------------------------
// change
// 두 개 변수의 값을 서로 바꾸는 함수를 만든다. 
// pointer, reference, 원격 조종
//------------------------------------------------------------------------------------------------------------
#include <iostream>

#include "save.h"

void change(int& a, int& b);	//함수 선언

int main()
{
	int a{ 1 }, b{ 2 };

	// 여기서 코딩으로 a와 b의 값을 바꿔주세요
	change(a, b);

	std::cout << "a - " << a << ", b - " << b << std::endl;	//a - 2, b - 1

	//save("main.cpp");
}

void change(int& a, int& b)	// 함수 정의 
{
	int temp{ a };
	a = b;
	b = temp;
}
