//------------------------------------------------------------------------------------------------------------
// 변수와 메모리 
// STACK의 한계  / 1MB
//------------------------------------------------------------------------------------------------------------
#include <iostream>

#include "save.h"
#define Max 1'800'000'000

// [문제] 전역변수의 최대 크기를 알아본다.
// 한계는 2GB
char c[Max]{1,2,3};


int main()
{
	std::cout << c[Max-1] << std::endl;
	for (auto& n : c) {
		std::cout << static_cast<char>(n + '0') << ' ';
	}
	//save("main.cpp");
}
