//------------------------------------------------------------------------------------------------------------
//	
//------------------------------------------------------------------------------------------------------------
#include <iostream>

#include "save.h"

int main()
{	// C++언어는 프로그램이 실행되면 입출력하기 위한 객체를 자동으로 생성한다. 
	// cin	-	키보드
	// cout	-	모니터
	// cerr	-	모니터 
	// clog	-	모니터

	std::cerr << "Hello, World!" << std::endl;
	std::clog << "Hello, World!" << std::endl;
	// 모두 가능 

	save("main.cpp");

}